package HW1_8;

public class HW_2 {

    public static void main(String[] args) {
        int a=1;
        int b=3;

        System.out.println("Сумма = " + (a + b));
        System.out.println("Произведение = " + a * b);
        System.out.println("Разность = "+ (a - b));
        System.out.println("Частное = "+ 1.0 * a / b);
        System.out.println("Остаток от деления = "+ a % b);

        System.out.println("a is odd:" + a % 2);
        System.out.println("b is odd:" + b % 2);

        }

        //Задача №2 TO DO
    //
    //Создать программу дележа добычи на пиратском корабле. По обычаю, половина добычи идет владельцу корабля, половина оставшегося — капитану, остальное делится поровну между всеми членами команды, включая капитана.
    //
    //Размер добычи (например, в пиастрах) и количество пиратов на корабле задать переменными.
    //
    //Вывести на экран кому сколько пиастров полагается
    //Сколько получит капитан (Джек Воробей, естественно), если он утверждает, что корабль принадлежит ему?
    //
    //Дополнительное задание со звездочкой
    //Попробовать придумать как программа может проверить правильность дележа.
}
